# Filtering out data from Dataframe and Series

In [3]:
# Importing pandas library and loading data
import pandas as pd
df = pd.read_csv(r"C:\Users\battih\Desktop\Personal\Python\data\extracted_data\survey_results_public.csv")
schema_df = pd.read_csv(r"C:\Users\battih\Desktop\Personal\Python\data\extracted_data\survey_results_schema.csv")

In [4]:
people = {
    'first' : ['Huzefa', 'Jane', 'John'],
    'last' : ['Battiwala', 'Doe', 'Doe'],
    'email' : ['battih@gmail.com', 'johndoe@gmail.com', 'janedoe@gmail.com']
}

In [5]:
dict_df = pd.DataFrame(people)

Filtering data from people where the last name is doe

In [6]:
dict_df['last'] == 'Doe' # This provide result as a mask with True and False series

0    False
1     True
2     True
Name: last, dtype: bool

In [ ]:
# 1st method of filtering
filt = (dict_df['last'] == 'Doe')
dict_df[filt]

  first last              email
1  Jane  Doe  johndoe@gmail.com
2  John  Doe  janedoe@gmail.com

In [8]:
# 2nd method of filtering
dict_df[dict_df['last'] == 'Doe']

  first last              email
1  Jane  Doe  johndoe@gmail.com
2  John  Doe  janedoe@gmail.com

In [12]:
# 3rd method of filtering with loc and iloc
dict_df.loc[filt]

  first last              email
1  Jane  Doe  johndoe@gmail.com
2  John  Doe  janedoe@gmail.com

In [13]:
# Filtering for specific column in dataframe
dict_df.loc[filt,'email']

1    johndoe@gmail.com
2    janedoe@gmail.com
Name: email, dtype: object

And "&" Or "|" Operator in dataframe

In [ ]:
# Filtering data based on multiple columns with "|" operator
filt = (dict_df['last'] == 'Doe') | (dict_df['first'] == 'John')
dict_df.loc[filt]

  first last              email
1  Jane  Doe  johndoe@gmail.com
2  John  Doe  janedoe@gmail.com

In [ ]:
# Negate the condition: Opposite of current condition using "~" function
dict_df.loc[~filt]

    first       last             email
0  Huzefa  Battiwala  battih@gmail.com

In [ ]:
# Filtering data based on multiple columns with "&" operator
filt = (dict_df['last'] == 'Doe') & (dict_df['first'] == 'John')
dict_df.loc[filt]

  first last              email
2  John  Doe  janedoe@gmail.com

## Stackoverflow data

In [ ]:
# Filtering data with highsalary
high_salary = (df['ConvertedComp'] > 70000)
df.loc[high_salary,['Country', 'LanguageWorkedWith','ConvertedComp']]

,Country,LanguageWorkedWith,ConvertedComp
5,Canada,Java;R;SQL,366420.0
8,New Zealand,Bash/Shell/PowerShell;C#;HTML/CSS;JavaScript;P...,95179.0
12,United States,Bash/Shell/PowerShell;HTML/CSS;JavaScript;PHP;...,90000.0
15,United Kingdom,Bash/Shell/PowerShell;C#;HTML/CSS;JavaScript;T...,455352.0
21,United States,Bash/Shell/PowerShell;C++;HTML/CSS;JavaScript;...,103000.0
...,...,...,...
88323,United States,Bash/Shell/PowerShell;C#;HTML/CSS;Java;Python;...,180000.0
88324,United States,Bash/Shell/PowerShell;C;Clojure;HTML/CSS;Java;...,2000000.0
88325,United States,HTML/CSS;JavaScript;Scala;TypeScript,130000.0
88326,Finland,Bash/Shell/PowerShell;C++;Python,82488.0
88329,Netherlands,C#;HTML/CSS;Java;JavaScript;PHP;Python,588012.0

In [22]:
# Applying filter with multiple values
countries = ['United States', 'India', 'United Kingdom', 'Germany', 'Canada']
filt = (df['Country'].isin(countries))
df.loc[filt,['Country']]

              Country
0      United Kingdom
3       United States
5              Canada
7               India
9               India
...               ...
88859   United States
88863  United Kingdom
88864           India
88877   United States
88878          Canada

[45008 rows x 1 columns]

In [28]:
filt = df['LanguageWorkedWith'].str.contains('Python', na=False)
df.loc[filt,['Country','LanguageWorkedWith']]

,Country,LanguageWorkedWith
0,United Kingdom,HTML/CSS;Java;JavaScript;Python
1,Bosnia and Herzegovina,C++;HTML/CSS;Python
3,United States,C;C++;C#;Python;SQL
4,Ukraine,C++;HTML/CSS;Java;JavaScript;Python;SQL;VBA
7,India,Bash/Shell/PowerShell;C;C++;HTML/CSS;Java;Java...
...,...,...
88854,United Kingdom,Bash/Shell/PowerShell;C;C++;HTML/CSS;Java;Java...
88860,Brazil,Bash/Shell/PowerShell;C++;Python;Ruby;Other(s):
88865,Switzerland,Bash/Shell/PowerShell;HTML/CSS;Python;Other(s):
88872,Czech Republic,C;C++;HTML/CSS;JavaScript;PHP;Python;SQL
88876,Spain,HTML/CSS;JavaScript;Python